wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_rcc.h
/**
  * @brief RCC_APB2ENR Register Bit Definition
  */
#define  RCC_APB2ENR_TIM1_Pos                     (0)
#define  RCC_APB2ENR_TIM1_Msk                     (0x01U << RCC_APB2ENR_TIM1_Pos)     /*!<*/
#define  RCC_APB2ENR_TIM8_Pos                     (1)
#define  RCC_APB2ENR_TIM8_Msk                     (0x01U << RCC_APB2ENR_TIM8_Pos)     /*!<*/
#define  RCC_APB2ENR_UART1_Pos                    (4)
#define  RCC_APB2ENR_UART1_Msk                    (0x01U << RCC_APB2ENR_UART1_Pos)    /*!<*/
#define  RCC_APB2ENR_UART6_Pos                    (5)
#define  RCC_APB2ENR_UART6_Msk                    (0x01U << RCC_APB2ENR_UART6_Pos)    /*!<*/
#define  RCC_APB2ENR_ADC1_Pos                     (8)
#define  RCC_APB2ENR_ADC1_Msk                     (0x01U << RCC_APB2ENR_ADC1_Pos)     /*!<*/
#define  RCC_APB2ENR_ADC2_Pos                     (9)
#define  RCC_APB2ENR_ADC2_Msk                     (0x01U << RCC_APB2ENR_ADC2_Pos)     /*!<*/
#define  RCC_APB2ENR_SPI1_Pos                     (12)
#define  RCC_APB2ENR_SPI1_Msk                     (0x01U << RCC_APB2ENR_SPI1_Pos)     /*!<*/
#define  RCC_APB2ENR_SYSCFG_Pos                   (14)
#define  RCC_APB2ENR_SYSCFG_Msk                   (0x01U << RCC_APB2ENR_SYSCFG_Pos)   /*!<*/
#define  RCC_APB2ENR_COMP_Pos                     (15)
#define  RCC_APB2ENR_COMP_Msk                     (0x01U << RCC_APB2ENR_COMP_Pos)     /*!<*/
#define  RCC_APB2ENR_FLEXCAN2_Pos                 (24)
#define  RCC_APB2ENR_FLEXCAN2_Msk                 (0x01U << RCC_APB2ENR_FLEXCAN2_Pos) /*!<*/
#define  RCC_APB2ENR_MDS_Pos                      (28)
#define  RCC_APB2ENR_MDS_Msk                      (0x01U << RCC_APB2ENR_MDS_Pos)      /*!<*/
#define  RCC_APB2ENR_LPTIM_Pos                    (30)
#define  RCC_APB2ENR_LPTIM_Msk                    (0x01U << RCC_APB2ENR_LPTIM_Pos)    /*!<*/
#define  RCC_APB2ENR_LPUART_Pos                   (31)
#define  RCC_APB2ENR_LPUART_Msk                   (0x01U << RCC_APB2ENR_LPUART_Pos)   /*!<*/

/**
  * @brief RCC_APB1ENR Register Bit Definition
  */
#define  RCC_APB1ENR_TIM2_Pos                     (0)
#define  RCC_APB1ENR_TIM2_Msk                     (0x01U << RCC_APB1ENR_TIM2_Pos)     /*!<*/
#define  RCC_APB1ENR_TIM3_Pos                     (1)
#define  RCC_APB1ENR_TIM3_Msk                     (0x01U << RCC_APB1ENR_TIM3_Pos)     /*!<*/
#define  RCC_APB1ENR_TIM4_Pos                     (2)
#define  RCC_APB1ENR_TIM4_Msk                     (0x01U << RCC_APB1ENR_TIM4_Pos)     /*!<*/
#define  RCC_APB1ENR_TIM5_Pos                     (3)
#define  RCC_APB1ENR_TIM5_Msk                     (0x01U << RCC_APB1ENR_TIM5_Pos)     /*!<*/
#define  RCC_APB1ENR_TIM6_Pos                     (4)
#define  RCC_APB1ENR_TIM6_Msk                     (0x01U << RCC_APB1ENR_TIM6_Pos)     /*!<*/
#define  RCC_APB1ENR_TIM7_Pos                     (5)
#define  RCC_APB1ENR_TIM7_Msk                     (0x01U << RCC_APB1ENR_TIM7_Pos)     /*!<*/
#define  RCC_APB1ENR_WWDG_Pos                     (11)
#define  RCC_APB1ENR_WWDG_Msk                     (0x01U << RCC_APB1ENR_WWDG_Pos)     /*!<*/
#define  RCC_APB1ENR_SPI2_Pos                     (14)
#define  RCC_APB1ENR_SPI2_Msk                     (0x01U << RCC_APB1ENR_SPI2_Pos)     /*!<*/
#define  RCC_APB1ENR_SPI3_Pos                     (15)
#define  RCC_APB1ENR_SPI3_Msk                     (0x01U << RCC_APB1ENR_SPI3_Pos)     /*!<*/
#define  RCC_APB1ENR_UART2_Pos                    (17)
#define  RCC_APB1ENR_UART2_Msk                    (0x01U << RCC_APB1ENR_UART2_Pos)    /*!<*/
#define  RCC_APB1ENR_UART3_Pos                    (18)
#define  RCC_APB1ENR_UART3_Msk                    (0x01U << RCC_APB1ENR_UART3_Pos)    /*!<*/
#define  RCC_APB1ENR_UART4_Pos                    (19)
#define  RCC_APB1ENR_UART4_Msk                    (0x01U << RCC_APB1ENR_UART4_Pos)    /*!<*/
#define  RCC_APB1ENR_UART5_Pos                    (20)
#define  RCC_APB1ENR_UART5_Msk                    (0x01U << RCC_APB1ENR_UART5_Pos)    /*!<*/
#define  RCC_APB1ENR_I2C1_Pos                     (21)
#define  RCC_APB1ENR_I2C1_Msk                     (0x01U << RCC_APB1ENR_I2C1_Pos)     /*!<*/
#define  RCC_APB1ENR_I2C2_Pos                     (22)
#define  RCC_APB1ENR_I2C2_Msk                     (0x01U << RCC_APB1ENR_I2C2_Pos)     /*!<*/
#define  RCC_APB1ENR_CRS_Pos                      (24)
#define  RCC_APB1ENR_CRS_Msk                      (0x01U << RCC_APB1ENR_CRS_Pos)      /*!<*/
#define  RCC_APB1ENR_FLEXCAN1_Pos                 (25)
#define  RCC_APB1ENR_FLEXCAN1_Msk                 (0x01U << RCC_APB1ENR_FLEXCAN1_Pos) /*!<*/
#define  RCC_APB1ENR_BKP_Pos                      (27)
#define  RCC_APB1ENR_BKP_Msk                      (0x01U << RCC_APB1ENR_BKP_Pos)      /*!<*/
#define  RCC_APB1ENR_PWRDBG_Pos                   (28)
#define  RCC_APB1ENR_PWRDBG_Msk                   (0x01U << RCC_APB1ENR_PWRDBG_Pos)   /*!<*/
#define  RCC_APB1ENR_DAC_Pos                      (29)
#define  RCC_APB1ENR_DAC_Msk                      (0x01U << RCC_APB1ENR_DAC_Pos)      /*!<*/
#define  RCC_APB1ENR_UART7_Pos                    (30)
#define  RCC_APB1ENR_UART7_Msk                    (0x01U << RCC_APB1ENR_UART7_Pos)    /*!<*/

/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define  RCC_BDCR_LSEON_Pos                       (0)
#define  RCC_BDCR_LSEON_Msk                       (0x01U << RCC_BDCR_LSEON_Pos)  /*!<*/
#define  RCC_BDCR_LSERDY_Pos                      (1)
#define  RCC_BDCR_LSERDY_Msk                      (0x01U << RCC_BDCR_LSERDY_Pos) /*!<*/
#define  RCC_BDCR_LSEBYP_Pos                      (2)
#define  RCC_BDCR_LSEBYP_Msk                      (0x01U << RCC_BDCR_LSEBYP_Pos) /*!<*/
#define  RCC_BDCR_RTCSEL_Pos                      (8)
#define  RCC_BDCR_RTCSEL_Msk                      (0x03U << RCC_BDCR_RTCSEL_Pos) /*!<*/
#define  RCC_BDCR_RTCEN_Pos                       (15)
#define  RCC_BDCR_RTCEN_Msk                       (0x01U << RCC_BDCR_RTCEN_Pos)  /*!<*/
#define  RCC_BDCR_BDRST_Pos                       (16)
#define  RCC_BDCR_BDRST_Msk                       (0x01U << RCC_BDCR_BDRST_Pos)  /*!<*/
#define  RCC_BDCR_DBP_Pos                         (24)
#define  RCC_BDCR_DBP_Msk                         (0x01U << RCC_BDCR_DBP_Pos)    /*!<*/

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define  RCC_CSR_LSION_Pos                        (0)
#define  RCC_CSR_LSION_Msk                        (0x01U << RCC_CSR_LSION_Pos)    /*!<*/
#define  RCC_CSR_LSIRDY_Pos                       (1)
#define  RCC_CSR_LSIRDY_Msk                       (0x01U << RCC_CSR_LSIRDY_Pos)   /*!<*/
#define  RCC_CSR_LSIOE_Pos                        (5)
#define  RCC_CSR_LSIOE_Msk                        (0x01U << RCC_CSR_LSIOE_Pos)    /*!<*/
#define  RCC_CSR_PVDRSTEN_Pos                     (6)
#define  RCC_CSR_PVDRSTEN_Msk                     (0x01U << RCC_CSR_PVDRSTEN_Pos) /*!<*/
#define  RCC_CSR_LOCKUPEN_Pos                     (7)
#define  RCC_CSR_LOCKUPEN_Msk                     (0x01U << RCC_CSR_LOCKUPEN_Pos) /*!<*/
#define  RCC_CSR_PVDRSTF_Pos                      (22)
#define  RCC_CSR_PVDRSTF_Msk                      (0x01U << RCC_CSR_PVDRSTF_Pos)  /*!<*/
#define  RCC_CSR_LOCKUPF_Pos                      (23)
#define  RCC_CSR_LOCKUPF_Msk                      (0x01U << RCC_CSR_LOCKUPF_Pos)  /*!<*/
#define  RCC_CSR_RMVF_Pos                         (24)
#define  RCC_CSR_RMVF_Msk                         (0x01U << RCC_CSR_RMVF_Pos)     /*!<*/
#define  RCC_CSR_PINRSTF_Pos                      (26)
#define  RCC_CSR_PINRSTF_Msk                      (0x01U << RCC_CSR_PINRSTF_Pos)  /*!<*/
#define  RCC_CSR_PORRSTF_Pos                      (27)
#define  RCC_CSR_PORRSTF_Msk                      (0x01U << RCC_CSR_PORRSTF_Pos)  /*!<*/
#define  RCC_CSR_SFTRSTF_Pos                      (28)
#define  RCC_CSR_SFTRSTF_Msk                      (0x01U << RCC_CSR_SFTRSTF_Pos)  /*!<*/
#define  RCC_CSR_IWDGRSTF_Pos                     (29)
#define  RCC_CSR_IWDGRSTF_Msk                     (0x01U << RCC_CSR_IWDGRSTF_Pos) /*!<*/
#define  RCC_CSR_WWDGRSTF_Pos                     (30)
#define  RCC_CSR_WWDGRSTF_Msk                     (0x01U << RCC_CSR_WWDGRSTF_Pos) /*!<*/
#define  RCC_CSR_LPWRRSTF_Pos                     (31)
#define  RCC_CSR_LPWRRSTF_Msk                     (0x01U << RCC_CSR_LPWRRSTF_Pos) /*!<*/

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define  RCC_SYSCFG_PROG_CHECK_EN_Pos             (0)
#define  RCC_SYSCFG_PROG_CHECK_EN_Msk             (0x01U << RCC_SYSCFG_PROG_CHECK_EN_Pos) /*!<*/
#define  RCC_SYSCFG_HSE_RFB_SEL_Pos               (8)
#define  RCC_SYSCFG_HSE_RFB_SEL_Msk               (0x03U << RCC_SYSCFG_HSE_RFB_SEL_Pos)   /*!<*/
#define  RCC_SYSCFG_HSELPFEN_Pos                  (14)
#define  RCC_SYSCFG_HSELPFEN_Msk                  (0x01U << RCC_SYSCFG_HSELPFEN_Pos)      /*!<*/

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define  RCC_CFGR2_TIMADV_CKSEL_Pos               (0)
#define  RCC_CFGR2_TIMADV_CKSEL_Msk               (0x01U << RCC_CFGR2_TIMADV_CKSEL_Pos)    /*!<*/
#define  RCC_CFGR2_TIMADV_PRE_Pos                 (1)
#define  RCC_CFGR2_TIMADV_PRE_Msk                 (0x07U << RCC_CFGR2_TIMADV_PRE_Pos)      /*!<*/
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Pos            (16)
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Msk            (0x0FU << RCC_CFGR2_APB1_CLK_HV_PRE_Pos) /*!<*/
#define  RCC_CFGR2_MCO_PRE_Pos                    (20)
#define  RCC_CFGR2_MCO_PRE_Msk                    (0x0FU << RCC_CFGR2_MCO_PRE_Pos)         /*!<*/
#define  RCC_CFGR2_LPUARTCLKSEL_Pos               (26)
#define  RCC_CFGR2_LPUARTCLKSEL_Msk               (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos)    /*!<*/
#define  RCC_CFGR2_LPTIMCLKSEL_Pos                (29)
#define  RCC_CFGR2_LPTIMCLKSEL_Msk                (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)     /*!<*/

/**
  * @brief RCC_ICSCR Register Bit Definition
  */
#define  RCC_ICSCR_TRIM_CRS_SEL_Pos               (0)
#define  RCC_ICSCR_TRIM_CRS_SEL_Msk               (0x01U << RCC_ICSCR_TRIM_CRS_SEL_Pos) /*!<*/

/**
  * @brief RCC_PLL1CFGR Register Bit Definition
  */
#define  RCC_PLL1CFGR_PLL1SRC_Pos                 (0)
#define  RCC_PLL1CFGR_PLL1SRC_Msk                 (0x01U << RCC_PLL1CFGR_PLL1SRC_Pos)    /*!<*/
#define  RCC_PLL1CFGR_PLL1XTPRE_Pos               (1)
#define  RCC_PLL1CFGR_PLL1XTPRE_Msk               (0x01U << RCC_PLL1CFGR_PLL1XTPRE_Pos)  /*!<*/
#define  RCC_PLL1CFGR_PLL1_ICTRL_Pos              (2)
#define  RCC_PLL1CFGR_PLL1_ICTRL_Msk              (0x03U << RCC_PLL1CFGR_PLL1_ICTRL_Pos) /*!<*/
#define  RCC_PLL1CFGR_PLL1_LDS_Pos                (4)
#define  RCC_PLL1CFGR_PLL1_LDS_Msk                (0x07U << RCC_PLL1CFGR_PLL1_LDS_Pos)   /*!<*/
#define  RCC_PLL1CFGR_PLL1DIV_Pos                 (8)
#define  RCC_PLL1CFGR_PLL1DIV_Msk                 (0x07U << RCC_PLL1CFGR_PLL1DIV_Pos)    /*!<*/
#define  RCC_PLL1CFGR_PLL1MUL_Pos                 (16)
#define  RCC_PLL1CFGR_PLL1MUL_Msk                 (0x7FU << RCC_PLL1CFGR_PLL1MUL_Pos)    /*!<*/

/**
  * @brief RCC_PLL2CFGR Register Bit Definition
  */
#define  RCC_PLL2CFGR_PLL2SRC_Pos                 (0)
#define  RCC_PLL2CFGR_PLL2SRC_Msk                 (0x01U << RCC_PLL2CFGR_PLL2SRC_Pos)    /*!<*/
#define  RCC_PLL2CFGR_PLL2XTPRE_Pos               (1)
#define  RCC_PLL2CFGR_PLL2XTPRE_Msk               (0x01U << RCC_PLL2CFGR_PLL2XTPRE_Pos)  /*!<*/
#define  RCC_PLL2CFGR_PLL2_ICTRL_Pos              (2)
#define  RCC_PLL2CFGR_PLL2_ICTRL_Msk              (0x03U << RCC_PLL2CFGR_PLL2_ICTRL_Pos) /*!<*/
#define  RCC_PLL2CFGR_PLL2_LDS_Pos                (4)
#define  RCC_PLL2CFGR_PLL2_LDS_Msk                (0x07U << RCC_PLL2CFGR_PLL2_LDS_Pos)   /*!<*/
#define  RCC_PLL2CFGR_PLL2DIV_Pos                 (8)
#define  RCC_PLL2CFGR_PLL2DIV_Msk                 (0x07U << RCC_PLL2CFGR_PLL2DIV_Pos)    /*!<*/
#define  RCC_PLL2CFGR_PLL2MUL_Pos                 (16)
#define  RCC_PLL2CFGR_PLL2MUL_Msk                 (0xFFU << RCC_PLL2CFGR_PLL2MUL_Pos)    /*!<*/
#define  RCC_PLL2CFGR_PLL2PDIV_Pos                (24)
#define  RCC_PLL2CFGR_PLL2PDIV_Msk                (0x07U << RCC_PLL2CFGR_PLL2PDIV_Pos)   /*!<*/

/**
  * @brief RCC_ADC1CFGR Register Bit Definition
  */
#define  RCC_ADC1CFGR_PRE_Pos                     (0)
#define  RCC_ADC1CFGR_PRE_Msk                     (0x0FU << RCC_ADC1CFGR_PRE_Pos)      /*!<*/
#define  RCC_ADC1CFGR_PRECAL_Pos                  (8)
#define  RCC_ADC1CFGR_PRECAL_Msk                  (0x01FFU << RCC_ADC1CFGR_PRECAL_Pos) /*!<*/

/**
  * @brief RCC_ADC2CFGR Register Bit Definition
  */
#define  RCC_ADC2CFGR_PRE_Pos                     (0)
#define  RCC_ADC2CFGR_PRE_Msk                     (0x0FU << RCC_ADC2CFGR_PRE_Pos)      /*!<*/
#define  RCC_ADC2CFGR_PRECAL_Pos                  (8)
#define  RCC_ADC2CFGR_PRECAL_Msk                  (0x01FFU << RCC_ADC2CFGR_PRECAL_Pos) /*!<*/

/**
  * @brief RCC_DACCFGR Register Bit Definition
  */
#define  RCC_DACCFGR_PRE_Pos                      (0)
#define  RCC_DACCFGR_PRE_Msk                      (0x7FU << RCC_DACCFGR_PRE_Pos) /*!<*/

/**
  * @brief RCC_TPIUCFGR Register Bit Definition
  */
#define  RCC_TPIUCFGR_PRE_Pos                     (0)
#define  RCC_TPIUCFGR_PRE_Msk                     (0x03U << RCC_TPIUCFGR_PRE_Pos) /*!<*/

#endif

